<? if (empty($data)): ?>
    <div class="block-list d-flex justify-center text-center">
        <div class="block-list__item default-block default-block_padding text-center">
            <p class="block-list__text">Нет расписания для групп</p>
        </div>
    </div>
<? else: ?>
    <div class="block-list d-grid grid-col-2 gap-2">
        <? foreach ($data as $item): ?>
            <div class="block-list__item default-block default-block_padding">
                <div class="d-flex align-items-center justify-content-between mb-2">
                    <h3 class="block-list__title"><?= $item["name"] ?> </h3>
                </div>
                <? if ($item["program"]): ?>
                    <div class="d-flex align-items-center justify-content-between mb-2 gap-2">
                        <svg fill="currentColor" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="24px" height="24px" viewBox="0 0 29.127 29.128" xml:space="preserve">
                            <path d="M22.471,15.103c0,1.021,0.824,1.847,1.849,1.847c1.021,0,1.845-0.826,1.845-1.847c0-1.021-0.824-1.847-1.845-1.847 C23.295,13.254,22.471,14.081,22.471,15.103z"></path>
                            <path d="M21.66,20.878c0,1.465,1.19,2.657,2.659,2.657c1.463,0,2.654-1.192,2.654-2.657c0-1.468-1.191-2.659-2.654-2.659 C22.85,18.219,21.66,19.41,21.66,20.878z"></path>
                            <polygon points="27.485,24.576 25.344,23.932 24.364,25.107 23.352,23.932 21.004,24.576 21.004,29.056 27.633,29.056 "></polygon>
                            <path d="M14.808,18.293c-1.467,0-2.659,1.191-2.659,2.658c0,1.465,1.192,2.657,2.659,2.657c1.466,0,2.656-1.192,2.656-2.657 C17.463,19.485,16.272,18.293,14.808,18.293z"></path>
                            <polygon points="15.835,24.006 14.852,25.183 13.842,24.006 11.494,24.65 11.494,29.128 18.124,29.128 17.975,24.65 "></polygon>
                            <circle cx="19.487" cy="17.242" r="1.944"></circle>
                            <path d="M21.91,23.107c-0.347-0.654-0.588-1.364-0.588-2.156c0-0.521,0.141-1.005,0.298-1.474H21.43h-0.473h-0.723l-0.717,0.86 l-0.739-0.86h-0.761h-0.424c0.196,0.455,0.31,0.952,0.31,1.472c0,0.855-0.3,1.638-0.794,2.278h4.803L21.91,23.107z"></path>
                            <circle cx="6.152" cy="10.675" r="3.732"></circle>
                            <polygon points="14.664,12.543 9.908,14.967 7.51,14.967 6.089,16.617 4.711,14.967 1.703,15.612 1.495,22.236 2.775,22.236 2.826,23.264 9.576,23.264 9.903,16.904 15.242,14.289 "></polygon>
                            <path d="M13.141,8.3l-1.498,2.234l0.581-0.046c0.04-0.004,3.914-0.328,6.596-0.923c3.521-0.778,5.616-2.336,5.755-4.273 c0.186-2.635-2.781-4.998-6.612-5.267c-3.83-0.27-7.097,1.654-7.282,4.289C10.575,5.807,11.49,7.281,13.141,8.3z M17.924,0.586 c3.521,0.248,6.254,2.341,6.088,4.667c-0.166,2.373-3.771,3.423-5.312,3.764c-2.027,0.449-4.753,0.743-5.935,0.857l1.178-1.76 L13.68,7.965c-1.622-0.913-2.534-2.265-2.44-3.612C11.406,2.028,14.402,0.339,17.924,0.586z"></path>
                        </svg>
                        <spam><?= $item["program"] ?></spam>
                    </div>
                <? endif; ?>

                <? if ($item["notes"]): ?>
                    <div class="d-flex align-items-center justify-content-between mb-2 gap-2">
                        <svg width="24px" height="24px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M11 4H7.2C6.0799 4 5.51984 4 5.09202 4.21799C4.71569 4.40974 4.40973 4.7157 4.21799 5.09202C4 5.51985 4 6.0799 4 7.2V16.8C4 17.9201 4 18.4802 4.21799 18.908C4.40973 19.2843 4.71569 19.5903 5.09202 19.782C5.51984 20 6.0799 20 7.2 20H16.8C17.9201 20 18.4802 20 18.908 19.782C19.2843 19.5903 19.5903 19.2843 19.782 18.908C20 18.4802 20 17.9201 20 16.8V12.5M15.5 5.5L18.3284 8.32843M10.7627 10.2373L17.411 3.58902C18.192 2.80797 19.4584 2.80797 20.2394 3.58902C21.0205 4.37007 21.0205 5.6364 20.2394 6.41745L13.3774 13.2794C12.6158 14.0411 12.235 14.4219 11.8012 14.7247C11.4162 14.9936 11.0009 15.2162 10.564 15.3882C10.0717 15.582 9.54378 15.6885 8.48793 15.9016L8 16L8.04745 15.6678C8.21536 14.4925 8.29932 13.9048 8.49029 13.3561C8.65975 12.8692 8.89125 12.4063 9.17906 11.9786C9.50341 11.4966 9.92319 11.0768 10.7627 10.2373Z" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        </svg>
                        <spam><?= $item["notes"] ?></spam>
                    </div>
                <? endif; ?>

                <div class="d-flex align-items-center justify-content-between mb-2 gap-2">
                    <svg width="24px" height="24px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M7 10H17M7 14H12M7 3V5M17 3V5M6.2 21H17.8C18.9201 21 19.4802 21 19.908 20.782C20.2843 20.5903 20.5903 20.2843 20.782 19.908C21 19.4802 21 18.9201 21 17.8V8.2C21 7.07989 21 6.51984 20.782 6.09202C20.5903 5.71569 20.2843 5.40973 19.908 5.21799C19.4802 5 18.9201 5 17.8 5H6.2C5.0799 5 4.51984 5 4.09202 5.21799C3.71569 5.40973 3.40973 5.71569 3.21799 6.09202C3 6.51984 3 7.07989 3 8.2V17.8C3 18.9201 3 19.4802 3.21799 19.908C3.40973 20.2843 3.71569 20.5903 4.09202 20.782C4.51984 21 5.07989 21 6.2 21Z" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                    </svg>
                    <spam>Семестры</spam>
                </div>
                <div class="d-grid grid-col-<?= count($item["semesters"]) ?> gap-2 mb-2">
                    <? foreach ($item["semesters"] as $key => $semester): ?>
                        <a class="button" href="/admin/schedules/semester/<?= $key ?>/group/<?= $item["id"] ?>">
                            <?= $semester ?>
                        </a>
                    <? endforeach; ?>
                </div>
            </div>
        <? endforeach; ?>
    </div>
<? endif; ?>